app/views/admin/items/index.html.erb

			<tr>
				<td>#<%= i.order.id %>/#<%= i.id %></td>
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 1 LIMIT 1