app/views/admin/items/show.html.erb

	<h1>
		<%= @item.order.name %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 1 LIMIT 1