app/controllers/admin/items_controller.rb

SELECT "items".* FROM "items"
SELECT "items".* FROM "items" WHERE "items"."status" = 5
---
	def index
		if current_admin.admin?
			if params[:status].nil?
				@items = Item.all
			else
				@items = Item.where( :status => params[:status])

SELECT "items".* FROM "items" WHERE "items"."id" = 11 AND "items"."status" = 5 LIMIT 1
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 1 LIMIT 1
UPDATE "items" SET "status" = 10, "updated_at" = '2012-12-16 13:37:47.129706' WHERE "items"."id" = 11
---
	def set_expired
		if current_admin.admin?
			@items = Item.where(:status => 0).where("expires < '#{DateTime.current}'")
			for item in @items
				item.order.quantity += 1
				item.status = 8
				item.save

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "11"]]
SELECT "admins".* FROM "admins" WHERE "admins"."id" = 2 LIMIT 1
---
	def show
		@item = Item.find(params[:id])
		unless current_admin.admin?
			if @item.order.admin != current_admin

SELECT "admins".* FROM "admins" WHERE "admins"."id" = 2 LIMIT 1
---
	def confirm
		# find item
		@item = Item.where(
			:id => params[:id],
			:status => 5
		).first
		# do not allow access for those customers who dont own this item
		unless current_admin.admin?
			if @item.order.admin != current_admin