app/controllers/admin/orders_controller.rb

	def create
		@order = Order.new(params[:order])
		@order.admin_id = current_admin.id
		if @order.valid?
			@order.save
---
INSERT INTO "orders" ("admin_id", "comment", "created_at", "description", "name", "price", "quantity", "signs", "ticket_time", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"