app/controllers/writer/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."user_id" = 1 AND "items"."id" = $1 LIMIT 1  [["id", "7"]]
---
	def show
		@item = current_user.items.find(params[:id])

SELECT "items".* FROM "items" WHERE "items"."user_id" = 1 AND "items"."id" = 12 AND "items"."status" = 0 LIMIT 1
---
	def write
		@item = current_user.items.where(
			:id => params[:item_id],
			:status => 0
		).first()

SELECT "items".* FROM "items" WHERE "items"."user_id" = 1 AND "items"."id" = $1 LIMIT 1  [["id", "11"]]
UPDATE "items" SET "content" = 'Lorem lorem lorem', "updated_at" = '2012-12-15 20:04:48.268524' WHERE "items"."id" = 5
---
	def written
		@item = current_user.items.where(
			:id => params[:item_id],
			:status => 0
		).first()
		@item.content = params[:item][:content]
		@item.save

SELECT "items".* FROM "items" WHERE "items"."user_id" = 1 AND "items"."id" = $1 LIMIT 1  [["id", "6"]]
UPDATE "items" SET "status" = 5, "updated_at" = '2012-12-15 21:10:33.556171' WHERE "items"."id" = 6
---
	def close
		@item = current_user.items.where(
			:id => params[:item_id],
			:status => 0
		).first()
		# check if there is still time for this
		if @item.expires < DateTime.current
			@item.status = 8
			@item.save

SELECT "items".* FROM "items" WHERE "items"."user_id" = 1 AND "items"."id" = $1 LIMIT 1  [["id", "10"]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 10]]
---
	def delete
		@item = current_user.items.where(
			:id => params[:item_id],
			:status => 0
		).first
		@item.destroy