app/controllers/writer/orders_controller.rb

SELECT "items".* FROM "items" WHERE "items"."user_id" = 1 AND "items"."order_id" = 1 AND "items"."status" = 0
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "orders" SET "quantity" = 196, "updated_at" = '2012-12-15 20:31:03.719194' WHERE "orders"."id" = 1
INSERT INTO "items" ("content", "created_at", "expires", "order_id", "price", "status", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
	def write
	# this method was used to 'Write' button on order#show

		# if current user has an active ticket for this order, redirect to existing ticket
		already_exists = Item.where(
			:user_id => current_user.id,
			:order_id => params[:id],
			:status => 0 #means that this is a fresh text
		)
		already_exists.inspect
		unless already_exists.empty?
			redirect_to writer_item_write_path already_exists.first
			return #extremely important !
		end

		# unless, check if there are some free tickets
		@order = Order.find(params[:id])
		if @order.quantity > 0

			# tickets count - 1
			@order.quantity = @order.quantity - 1
			@order.save

			# new item for this order and current user
			i = Item.new
			i.order_id = @order.id
			i.user_id = current_user.id
			i.status = 0
			i.price = @order.price
			i.expires = DateTime.now + @order.ticket_time.to_i.seconds
			i.save