app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 1 LIMIT 1
---
	def write
		@item = Item.find(params[:id])
		@order = @item.order

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "5"]]
UPDATE "items" SET "content" = 'Lorem', "updated_at" = '2012-12-15 19:43:04.299339' WHERE "items"."id" = 5
---
	def written
		@item = Item.find(params[:id])
		@item.content = params[:item][:content]
		@item.save