app/controllers/orders_controller.rb

	def index
		@orders = Order.all
---
SELECT "orders".* FROM "orders" WHERE (quantity > 0)

	def write
	# this method was used to 'Write' button on order#show

		# if current user has an active ticket for this order, redirect to existing ticket
		already_exists = Item.where(:user_id => current_user.id, :order_id => params[:id])
		already_exists.inspect
		unless already_exists.empty?
			redirect_to write_item_path already_exists.first
			return #extremely important !
		end

		# unless, check if there are some free tickets
		@order = Order.find(params[:id])
		if @order.quantity > 0

			# tickets count - 1
			@order.quantity = @order.quantity - 1
			@order.save

			# new item for this order and current user
			i = Item.new
			i.order_id = @order.id
			i.user_id = current_user.id
			i.expires = DateTime.now + @order.ticket_time.to_i.seconds
			i.save
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = 1 AND "items"."order_id" = 1 LIMIT 1
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "orders" SET "quantity" = 99, "updated_at" = '2012-12-15 18:02:33.735198' WHERE "orders"."id" = 2
INSERT INTO "items" ("content", "created_at", "order_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", nil], ["created_at", Sat, 15 Dec 2012 18:02:33 UTC +00:00], ["order_id", 2], ["updated_at", Sat, 15 Dec 2012 18:02:33 UTC +00:00], ["user_id", 1]]