app/views/writer/items/show.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = 1 LIMIT 1
---
		<h1>
			<%= @item.order.name %>