app/views/writer/items/write.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = 1 LIMIT 1
---
		  <li><%= link_to 'Zlecenia', orders_path %> <span class="divider">/</span></li>
		  <li><%= link_to @item.order.formal_name, order_path(@item.order) %> <span class="divider">/</span></li>